{
  "Menu1": "HOME",
  "Menu2": "ABOUT ME",
  "Menu3": "PROJECTS",
  "Menu4": "CV",
  "Presentazione1": "Hello",
  "Presentazione2": "I'm",
  "Presentazione3": "Software Engineer",
  "PresentazioneBtn1": "Contact Me",
  "PresentazioneBtn2": "CV",
  "AboutTitle": "ABOUT ME",
  "About1": "Hi, I'm Gabriel Colla. I currently work as a ",
  "About2": "Software Engineer",
  "About3": " at NTT DATA, and in the past, I’ve worked as a full-stack developer. I’ve always loved the IT and Web3 world—so much so that I taught myself every programming language I could get my hands on and personally assembled over 30 custom-built desktop PCs. This is my little corner, where you can find more information about me and check out some of the projects I’ve worked on for fun or practice.",
  "SoftSkillsTitle": "SOFT SKILLS",
  "SoftSkills1": "COMUNICATION",
  "SoftSkills2": "TEAMWORK",
  "SoftSkills3": "PROBLEM SOLVING",
  "SoftSkills4": "CREATIVITY",
  "SoftSkills5": "ADAPTABILITY",
  "SoftSkills6": "TIME MANAGEMENT",
  "SoftSkills7": "EMPATHY",
  "SoftSkills8": "LEADERSHIP",
  "HardSkillsTitle": "HARD SKILLS",
  "HardSkills1": "FRONTEND DEVELOPMENT",
  "HardSkills2": "OBJECT-ORIENTED LANGUAGES",
  "HardSkills3": "DATABASE",
  "HardSkills4": "PROJECT MANAGEMENT",
  "EsperienzeTitle": "EDUCATION & EXPERIENCES",
  "AccordionTitle1": "High School Diploma - I.I.S. Calvino",
  "AccordionText1": "Skills acquired in Front-End and Back-End development (Java, C++, HTML/CSS, JavaScript), relational database design and management (SQL), and IT systems and network administration. In-depth understanding of business processes and the role of IT within organizational contexts, combined with a strong foundation in software engineering and development methodologies. Hands-on experience gained through projects and internships in professional IT environments.",
  "AccordionTitle2": "Software Developer Tester - FOS S.p.A.",
  "AccordionText2": "I performed functional and accessibility testing on regional healthcare web applications for Liguria, ensuring compliance with the Web Content Accessibility Guidelines (WCAG) 2.1 and the European Accessibility Act, thereby improving usability for all users, including those with disabilities. I developed and maintained automated test scripts using Selenium and Python. I worked closely with multidisciplinary teams—including developers, UX designers, and compliance officers—to identify and resolve accessibility issues, ensuring that applications met regulatory standards and provided an inclusive user experience. I also drafted accessibility statements and technical documentation in accordance with Directive (EU) 2016/2102.",
  "AccordionTitle3": "Software Developer - C Consulting S.p.A.",
  "AccordionText3": "Designed and developed a custom application to manage data migration between two major banking institutions, ensuring data integrity and regulatory compliance. Created an intuitive front-end interface using Angular to monitor and control the migration process. Developed secure and reliable back-end services in .NET to handle large volumes of sensitive financial data. Collaborated with stakeholders and technical teams to define requirements, validate workflows, and resolve issues throughout the migration phases. Contributed to testing, documentation, and deployment activities, supporting the timely and successful release of the migration tool.",
  "AccordionTitle4": "Software Engineer - NTT DATA",
  "AccordionText4": "I developed and maintained internal web applications for a major banking institution, ensuring high standards of performance and security. I built responsive front-end interfaces with Angular, following modern UI/UX principles. I designed and implemented robust back-end services in Java, integrating them with internal banking systems and APIs. I used proprietary enterprise frameworks to ensure architectural consistency and optimize development processes. I worked closely with cross-functional teams, including business analysts and QA engineers, to deliver reliable and scalable software solutions. I participated in code reviews, continuous integration processes, and Agile ceremonies, supporting the delivery of high-quality software. Additionally, I performed bug fixing and developed new features for an insurance client, focusing on back-end services in Java.",
  "Progetti1": "PROJECTS",
  "ProgettiTitle1": "Immobiliare Massena",
  "ProgettiText1": "Custom website for showcasing real estate properties.",
  "ProgettiTitle2": "Antonio Micucci PH",
  "ProgettiText2": "Photography portfolio for a freelance photographer.",
  "ProgettiTitle3": "Gioielleria Tre Passi",
  "ProgettiText3": "Showcase website for displaying a product catalog.",
  "ProgettiTitle4": "Simple Bazar",
  "ProgettiText4": "Price management tool for MMORPGs to monitor market prices.",
  "ProgettiButtonDemo": "View",
  "Footer1": "Software Engineer | Consultant",
  "Footer2": "Useful Links",
  "Footer3": "Contacts",
  "Footer4": "© 2025 Gabriel Colla. All rights reserved."
  
}