{
  "Menu1": "HOME",
  "Menu2": "SU DI ME",
  "Menu3": "PROGETTI",
  "Menu4": "CV",
  "Presentazione1": "Ciao",
  "Presentazione2": "Sono",
  "Presentazione3": "Software Engineer",
  "PresentazioneBtn1": "Contattami",
  "PresentazioneBtn2": "CV",
  "AboutTitle": "SU DI ME",
  "About1": "Ciao, sono Gabriel Colla, attualmente svolgo la funzione di ",
  "About2": "Software Engineer",
  "About3": "presso l’azienda NTT DATA, in passato ho fatto lo sviluppatore full-stack. Ho sempre amato l’ambito IT e Web3, al punto da studiare da autodidatta qualsiasi linguaggio mi passasse per le mani ed aver assemblato con le mie mani più di 30 PC fissi custom built. Questo è il mio piccolo angolo, dove si possono racimolare più informazioni su di me e visionare alcuni dei progetti che ho fatto per passatempo/allenamento.",
  "SoftSkillsTitle": "SOFT SKILLS",
  "SoftSkills1": "COMUNICAZIONE",
  "SoftSkills2": "LAVORO IN TEAM",
  "SoftSkills3": "RISOLUZIONE PROBLEMI",
  "SoftSkills4": "CREATIVITÀ",
  "SoftSkills5": "ADATTABILITÀ",
  "SoftSkills6": "GESTIONE DEL TEMPO",
  "SoftSkills7": "EMPATIA",
  "SoftSkills8": "LEADERSHIP",
  "HardSkillsTitle": "HARD SKILLS",
  "HardSkills1": "SVILUPPO FRONTEND",
  "HardSkills2": "LINGUAGGI AD OGGETTI",
  "HardSkills3": "DATABASE",
  "HardSkills4": "GESTIONE PROGETTUALE",
  "EsperienzeTitle": "ISTRUZIONE & ESPERIENZE",
  "AccordionTitle1": "Diploma di maturità - I.I.S. Calvino",
  "AccordionText1": "Competenze acquisite nello sviluppo Front-End e Back-End (Java, C++, HTML/CSS, JavaScript), nella progettazione e gestione di database relazionali (SQL), e nell’amministrazione di sistemi e reti informatiche. Approfondita conoscenza dei processi aziendali e del ruolo dell’IT nei contesti organizzativi, unita a solide basi in ingegneria del software e metodologie di sviluppo. Esperienza pratica maturata attraverso progetti e tirocini in ambienti IT professionali.",
  "AccordionTitle2": "Software Developer Tester - FOS S.p.A.",
  "AccordionText2": "Ho svolto attività di testing funzionale e di accessibilità su applicazioni web sanitarie regionali per la Liguria, garantendo la conformità alle Web Content Accessibility Guidelines (WCAG) 2.1 e al European Accessibility Act, migliorando l'usabilità per tutti gli utenti, inclusi quelli con disabilità. Ho sviluppato e mantenuto script di test automatizzati utilizzando Selenium e Python. Ho collaborato strettamente con team multidisciplinari — tra cui sviluppatori, UX designer e responsabili della conformità — per individuare e risolvere problematiche di accessibilità, assicurando che le applicazioni rispettassero gli standard normativi e offrissero un'esperienza inclusiva. Ho inoltre redatto dichiarazioni di accessibilità e documentazione tecnica in linea con la Direttiva (UE) 2016/2102.",
  "AccordionTitle3": "Software Developer - C Consulting S.p.A.",
  "AccordionText3": "Progettazione e sviluppo di un'applicazione personalizzata per gestire la migrazione dei dati tra due importanti istituti bancari, garantendo l'integrità dei dati e la conformità normativa. Realizzazione di un'interfaccia front-end intuitiva con Angular per il monitoraggio e il controllo del processo di migrazione. Sviluppo di servizi back-end sicuri e affidabili in .NET per la gestione di grandi volumi di dati finanziari sensibili. Collaborazione con stakeholder e team tecnici per la definizione dei requisiti, la validazione dei flussi di lavoro e la risoluzione di problematiche nelle diverse fasi della migrazione. Contributo alle attività di testing, documentazione e deployment, supportando il rilascio puntuale e di successo dello strumento di migrazione.",
  "AccordionTitle4": "Software Engineer - NTT DATA",
  "AccordionText4": "Ho sviluppato e mantenuto applicazioni web interne per una grande istituzione bancaria, garantendo elevati standard di performance e sicurezza. Ho realizzato interfacce front-end responsive con Angular, seguendo i principi moderni di UI/UX. Ho progettato e implementato servizi back-end robusti in Java, integrandoli con sistemi bancari interni e API. Ho utilizzato framework proprietari aziendali per assicurare coerenza con l’architettura enterprise e ottimizzare i processi di sviluppo. Ho collaborato strettamente con team cross-funzionali, inclusi business analyst e ingegneri QA, per fornire soluzioni software affidabili e scalabili. Ho partecipato a revisioni del codice, processi di integrazione continua e cerimonie Agile, supportando la consegna di software di alta qualità. Inoltre, ho effettuato bug fixing e sviluppato nuove funzionalità per un cliente assicurativo, concentrandomi sui servizi back-end in Java.",
  "Progetti1": "PROGETTI",
  "ProgettiTitle1": "Immobiliare Massena",
  "ProgettiText1": "Custom site per esposizione proprietà immobiliari.",
  "ProgettiTitle2": "Antonio Micucci PH",
  "ProgettiText2": "Portfolio fotografico per fotografo freelance.",
  "ProgettiTitle3": "Gioielleria Tre Passi",
  "ProgettiText3": "Sito vetrina per esposizione catalogo prodotti.",
  "ProgettiTitle4": "Simple Bazar",
  "ProgettiText4": "Strumento di gestione prezzi per MMORPG per il monitoring dei prezzi di mercato.",
  "ProgettiButtonDemo": "Visualizza",
  "Footer1": "Software Engineer | Consulente",
  "Footer2": "Link Utili",
  "Footer3": "Contatti",
  "Footer4": "© 2025 Gabriel Colla. Tutti i diritti riservati."
}